codeigniter-app/app/Controllers/Apm.php

INSERT INTO `users` (`name`, `email`) VALUES ('CodeIgniter User', 'ci_1756369284_8353@example.com')
SELECT *
FROM `users`
WHERE `id` = 17
---
    public function demoCrud()
    {
        try {
            $results = [];

            // Test CodeIgniter Database CRUD
            $db = \Config\Database::connect();

            // Create
            $email = 'ci_' . time() . '_' . rand(1000, 9999) . '@example.com';
            $data = [
                'name' => 'CodeIgniter User',
                'email' => $email
            ];

            $db->table('users')->insert($data);
            $insertId = $db->insertID();
            $results['codeigniter_created'] = ['id' => $insertId, 'email' => $email];

            // Read
            $user = $db->table('users')->where('id', $insertId)->get()->getRowArray();